In [2]:
import pandas as pd
import numpy as np

In [3]:
names = np.array(["John","Shawn","Mike","Nick","Sam","Tom","Ricky"])
series = pd.Series(names)

In [4]:
series

0     John
1    Shawn
2     Mike
3     Nick
4      Sam
5      Tom
6    Ricky
dtype: object

In [7]:
# pd.Series(names, index=[1,2,3,4,5,6,7])
series = pd.Series(names, index=['a','b','c','d','e','f','g'])

In [8]:
series

a     John
b    Shawn
c     Mike
d     Nick
e      Sam
f      Tom
g    Ricky
dtype: object

In [9]:
series[0]

'John'

In [10]:
series['a']

'John'

In [11]:
series.shape

(7,)

In [12]:
series.dtype

dtype('O')

In [13]:
series.head()

a     John
b    Shawn
c     Mike
d     Nick
e      Sam
dtype: object

In [14]:
series.head(3)

a     John
b    Shawn
c     Mike
dtype: object

In [16]:
series.tail(3)

e      Sam
f      Tom
g    Ricky
dtype: object

In [17]:
data = {
    "names" : names,
    "dept" : ["IT","IT","HR","Sales","IT","HR","Sales"],
    "salary" : [45000,50000,25000,80000,35000,50000,35000]
}

In [18]:
df = pd.DataFrame(data)

In [19]:
df

   names   dept  salary
0   John     IT   45000
1  Shawn     IT   50000
2   Mike     HR   25000
3   Nick  Sales   80000
4    Sam     IT   35000
5    Tom     HR   50000
6  Ricky  Sales   35000

In [21]:
df.columns

Index(['names', 'dept', 'salary'], dtype='object')

In [22]:
df.describe()

             salary
count      7.000000
mean   45714.285714
std    17660.825629
min    25000.000000
25%    35000.000000
50%    45000.000000
75%    50000.000000
max    80000.000000

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   7 non-null      object
 1   dept    7 non-null      object
 2   salary  7 non-null      int64
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [24]:
df.head()

   names   dept  salary
0   John     IT   45000
1  Shawn     IT   50000
2   Mike     HR   25000
3   Nick  Sales   80000
4    Sam     IT   35000

In [25]:
df['names']

0     John
1    Shawn
2     Mike
3     Nick
4      Sam
5      Tom
6    Ricky
Name: names, dtype: object

In [26]:
df['names'][:4]

0     John
1    Shawn
2     Mike
3     Nick
Name: names, dtype: object

In [27]:
df['names'].head(4)

0     John
1    Shawn
2     Mike
3     Nick
Name: names, dtype: object

In [29]:
df[['names','dept']]

   names   dept
0   John     IT
1  Shawn     IT
2   Mike     HR
3   Nick  Sales
4    Sam     IT
5    Tom     HR
6  Ricky  Sales

In [30]:
df[0:3]

   names dept  salary
0   John   IT   45000
1  Shawn   IT   50000
2   Mike   HR   25000

In [32]:
df.loc[0]

names      John
dept         IT
salary    45000
Name: 0, dtype: object

In [33]:
df.loc[0:3]

   names   dept  salary
0   John     IT   45000
1  Shawn     IT   50000
2   Mike     HR   25000
3   Nick  Sales   80000

In [34]:
df_2 = pd.DataFrame(data, index=['a','b','c','d','e','f','g'])

In [36]:
df_2.head(3)

   names dept  salary
a   John   IT   45000
b  Shawn   IT   50000
c   Mike   HR   25000

In [38]:
df_2.loc['a']

names      John
dept         IT
salary    45000
Name: a, dtype: object

In [39]:
df_2.iloc[0]

names      John
dept         IT
salary    45000
Name: a, dtype: object

In [40]:
df_2.iloc[0:3]

   names dept  salary
a   John   IT   45000
b  Shawn   IT   50000
c   Mike   HR   25000

In [41]:
df_2.loc['a':'c']

   names dept  salary
a   John   IT   45000
b  Shawn   IT   50000
c   Mike   HR   25000

In [42]:
# Apply Filters

In [44]:
df['dept'] == 'IT'

0     True
1     True
2    False
3    False
4     True
5    False
6    False
Name: dept, dtype: bool

In [45]:
df[df['dept'] == 'IT']

   names dept  salary
0   John   IT   45000
1  Shawn   IT   50000
4    Sam   IT   35000

In [46]:
df[df['dept'] == 'HR']

  names dept  salary
2  Mike   HR   25000
5   Tom   HR   50000

In [47]:
df[df['salary'] >= 50000]

   names   dept  salary
1  Shawn     IT   50000
3   Nick  Sales   80000
5    Tom     HR   50000

In [48]:
df[(df['salary'] >= 50000) & (df['dept'] == 'IT')]

   names dept  salary
1  Shawn   IT   50000